MikroElektronika/core_packages/ARM/gcc_clang/def/toshiba/TMPM4G9FEFG/mcu.h
/**
  * @brief Interrupt Control B Register
  */
typedef struct
{
       uint8_t  RESERVED0[16];
  __IO uint8_t  NIC00;             /*!< Non maskable Interrupu Control Register 00   */
       uint8_t  RESERVED1[79];
  __IO uint8_t  IMC000;            /*!< Interrupu Mode Control Register 000          */
  __IO uint8_t  IMC001;            /*!< Interrupu Mode Control Register 000          */
  __IO uint8_t  IMC002;            /*!< Interrupu Mode Control Register 000          */
  __IO uint8_t  IMC003;            /*!< Interrupu Mode Control Register 000          */
  __IO uint8_t  IMC004;            /*!< Interrupu Mode Control Register 000          */
  __IO uint8_t  IMC005;            /*!< Interrupu Mode Control Register 000          */
  __IO uint8_t  IMC006;            /*!< Interrupu Mode Control Register 000          */
  __IO uint8_t  IMC007;            /*!< Interrupu Mode Control Register 000          */
  __IO uint8_t  IMC008;            /*!< Interrupu Mode Control Register 000          */
  __IO uint8_t  IMC009;            /*!< Interrupu Mode Control Register 000          */
  __IO uint8_t  IMC010;            /*!< Interrupu Mode Control Register 000          */
  __IO uint8_t  IMC011;            /*!< Interrupu Mode Control Register 000          */
  __IO uint8_t  IMC012;            /*!< Interrupu Mode Control Register 000          */
  __IO uint8_t  IMC013;            /*!< Interrupu Mode Control Register 000          */
  __IO uint8_t  IMC014;            /*!< Interrupu Mode Control Register 000          */
  __IO uint8_t  IMC015;            /*!< Interrupu Mode Control Register 000          */
  __IO uint8_t  IMC016;            /*!< Interrupu Mode Control Register 000          */
  __IO uint8_t  IMC017;            /*!< Interrupu Mode Control Register 000          */
  __IO uint8_t  IMC018;            /*!< Interrupu Mode Control Register 000          */
  __IO uint8_t  IMC019;            /*!< Interrupu Mode Control Register 000          */
  __IO uint8_t  IMC020;            /*!< Interrupu Mode Control Register 000          */
  __IO uint8_t  IMC021;            /*!< Interrupu Mode Control Register 000          */
  __IO uint8_t  IMC022;            /*!< Interrupu Mode Control Register 000          */
  __IO uint8_t  IMC023;            /*!< Interrupu Mode Control Register 000          */
  __IO uint8_t  IMC024;            /*!< Interrupu Mode Control Register 000          */
  __IO uint8_t  IMC025;            /*!< Interrupu Mode Control Register 000          */
  __IO uint8_t  IMC026;            /*!< Interrupu Mode Control Register 000          */
  __IO uint8_t  IMC027;            /*!< Interrupu Mode Control Register 000          */
  __IO uint8_t  IMC028;            /*!< Interrupu Mode Control Register 000          */
  __IO uint8_t  IMC029;            /*!< Interrupu Mode Control Register 000          */
  __IO uint8_t  IMC030;            /*!< Interrupu Mode Control Register 000          */
  __IO uint8_t  IMC031;            /*!< Interrupu Mode Control Register 000          */
  __IO uint8_t  IMC032;            /*!< Interrupu Mode Control Register 000          */
  __IO uint8_t  IMC033;            /*!< Interrupu Mode Control Register 000          */
  __IO uint8_t  IMC034;            /*!< Interrupu Mode Control Register 000          */
  __IO uint8_t  IMC035;            /*!< Interrupu Mode Control Register 000          */
  __IO uint8_t  IMC036;            /*!< Interrupu Mode Control Register 000          */
  __IO uint8_t  IMC037;            /*!< Interrupu Mode Control Register 000          */
  __IO uint8_t  IMC038;            /*!< Interrupu Mode Control Register 000          */
  __IO uint8_t  IMC039;            /*!< Interrupu Mode Control Register 000          */
  __IO uint8_t  IMC040;            /*!< Interrupu Mode Control Register 000          */
  __IO uint8_t  IMC041;            /*!< Interrupu Mode Control Register 000          */
  __IO uint8_t  IMC042;            /*!< Interrupu Mode Control Register 000          */
  __IO uint8_t  IMC043;            /*!< Interrupu Mode Control Register 000          */
  __IO uint8_t  IMC044;            /*!< Interrupu Mode Control Register 000          */
  __IO uint8_t  IMC045;            /*!< Interrupu Mode Control Register 000          */
  __IO uint8_t  IMC046;            /*!< Interrupu Mode Control Register 000          */
  __IO uint8_t  IMC047;            /*!< Interrupu Mode Control Register 000          */
  __IO uint8_t  IMC048;            /*!< Interrupu Mode Control Register 000          */
  __IO uint8_t  IMC049;            /*!< Interrupu Mode Control Register 000          */
  __IO uint8_t  IMC050;            /*!< Interrupu Mode Control Register 000          */
  __IO uint8_t  IMC051;            /*!< Interrupu Mode Control Register 000          */
  __IO uint8_t  IMC052;            /*!< Interrupu Mode Control Register 000          */
  __IO uint8_t  IMC053;            /*!< Interrupu Mode Control Register 000          */
  __IO uint8_t  IMC054;            /*!< Interrupu Mode Control Register 000          */
  __IO uint8_t  IMC055;            /*!< Interrupu Mode Control Register 000          */
  __IO uint8_t  IMC056;            /*!< Interrupu Mode Control Register 000          */
  __IO uint8_t  IMC057;            /*!< Interrupu Mode Control Register 000          */
  __IO uint8_t  IMC058;            /*!< Interrupu Mode Control Register 000          */
  __IO uint8_t  IMC059;            /*!< Interrupu Mode Control Register 000          */
  __IO uint8_t  IMC060;            /*!< Interrupu Mode Control Register 000          */
  __IO uint8_t  IMC061;            /*!< Interrupu Mode Control Register 000          */
  __IO uint8_t  IMC062;            /*!< Interrupu Mode Control Register 000          */
  __IO uint8_t  IMC063;            /*!< Interrupu Mode Control Register 000          */
  __IO uint8_t  IMC064;            /*!< Interrupu Mode Control Register 000          */
  __IO uint8_t  IMC065;            /*!< Interrupu Mode Control Register 000          */
  __IO uint8_t  IMC066;            /*!< Interrupu Mode Control Register 000          */
  __IO uint8_t  IMC067;            /*!< Interrupu Mode Control Register 000          */
  __IO uint8_t  IMC068;            /*!< Interrupu Mode Control Register 000          */
  __IO uint8_t  IMC069;            /*!< Interrupu Mode Control Register 000          */
  __IO uint8_t  IMC070;            /*!< Interrupu Mode Control Register 000          */
  __IO uint8_t  IMC071;            /*!< Interrupu Mode Control Register 000          */
  __IO uint8_t  IMC072;            /*!< Interrupu Mode Control Register 000          */
  __IO uint8_t  IMC073;            /*!< Interrupu Mode Control Register 000          */
  __IO uint8_t  IMC074;            /*!< Interrupu Mode Control Register 000          */
  __IO uint8_t  IMC075;            /*!< Interrupu Mode Control Register 000          */
  __IO uint8_t  IMC076;            /*!< Interrupu Mode Control Register 000          */
  __IO uint8_t  IMC077;            /*!< Interrupu Mode Control Register 000          */
  __IO uint8_t  IMC078;            /*!< Interrupu Mode Control Register 000          */
  __IO uint8_t  IMC079;            /*!< Interrupu Mode Control Register 000          */
  __IO uint8_t  IMC080;            /*!< Interrupu Mode Control Register 000          */
  __IO uint8_t  IMC081;            /*!< Interrupu Mode Control Register 000          */
  __IO uint8_t  IMC082;            /*!< Interrupu Mode Control Register 000          */
  __IO uint8_t  IMC083;            /*!< Interrupu Mode Control Register 000          */
  __IO uint8_t  IMC084;            /*!< Interrupu Mode Control Register 000          */
  __IO uint8_t  IMC085;            /*!< Interrupu Mode Control Register 000          */
  __IO uint8_t  IMC086;            /*!< Interrupu Mode Control Register 000          */
  __IO uint8_t  IMC087;            /*!< Interrupu Mode Control Register 000          */
  __IO uint8_t  IMC088;            /*!< Interrupu Mode Control Register 000          */
  __IO uint8_t  IMC089;            /*!< Interrupu Mode Control Register 000          */
  __IO uint8_t  IMC090;            /*!< Interrupu Mode Control Register 000          */
  __IO uint8_t  IMC091;            /*!< Interrupu Mode Control Register 000          */
  __IO uint8_t  IMC092;            /*!< Interrupu Mode Control Register 000          */
  __IO uint8_t  IMC093;            /*!< Interrupu Mode Control Register 000          */
  __IO uint8_t  IMC094;            /*!< Interrupu Mode Control Register 000          */
  __IO uint8_t  IMC095;            /*!< Interrupu Mode Control Register 000          */
  __IO uint8_t  IMC096;            /*!< Interrupu Mode Control Register 000          */
  __IO uint8_t  IMC097;            /*!< Interrupu Mode Control Register 000          */
  __IO uint8_t  IMC098;            /*!< Interrupu Mode Control Register 000          */
  __IO uint8_t  IMC099;            /*!< Interrupu Mode Control Register 000          */
  __IO uint8_t  IMC100;            /*!< Interrupu Mode Control Register 000          */
  __IO uint8_t  IMC101;            /*!< Interrupu Mode Control Register 000          */
  __IO uint8_t  IMC102;            /*!< Interrupu Mode Control Register 000          */
  __IO uint8_t  IMC103;            /*!< Interrupu Mode Control Register 000          */
  __IO uint8_t  IMC104;            /*!< Interrupu Mode Control Register 000          */
  __IO uint8_t  IMC105;            /*!< Interrupu Mode Control Register 000          */
  __IO uint8_t  IMC106;            /*!< Interrupu Mode Control Register 000          */
  __IO uint8_t  IMC107;            /*!< Interrupu Mode Control Register 000          */
  __IO uint8_t  IMC108;            /*!< Interrupu Mode Control Register 000          */
  __IO uint8_t  IMC109;            /*!< Interrupu Mode Control Register 000          */
  __IO uint8_t  IMC110;            /*!< Interrupu Mode Control Register 000          */
  __IO uint8_t  IMC111;            /*!< Interrupu Mode Control Register 000          */
  __IO uint8_t  IMC112;            /*!< Interrupu Mode Control Register 000          */
  __IO uint8_t  IMC113;            /*!< Interrupu Mode Control Register 000          */
  __IO uint8_t  IMC114;            /*!< Interrupu Mode Control Register 000          */
  __IO uint8_t  IMC115;            /*!< Interrupu Mode Control Register 000          */
  __IO uint8_t  IMC116;            /*!< Interrupu Mode Control Register 000          */
  __IO uint8_t  IMC117;            /*!< Interrupu Mode Control Register 000          */
  __IO uint8_t  IMC118;            /*!< Interrupu Mode Control Register 000          */
  __IO uint8_t  IMC119;            /*!< Interrupu Mode Control Register 000          */
  __IO uint8_t  IMC120;            /*!< Interrupu Mode Control Register 000          */
  __IO uint8_t  IMC121;            /*!< Interrupu Mode Control Register 000          */
  __IO uint8_t  IMC122;            /*!< Interrupu Mode Control Register 000          */
  __IO uint8_t  IMC123;            /*!< Interrupu Mode Control Register 000          */
  __IO uint8_t  IMC124;            /*!< Interrupu Mode Control Register 000          */
  __IO uint8_t  IMC125;            /*!< Interrupu Mode Control Register 000          */
  __IO uint8_t  IMC126;            /*!< Interrupu Mode Control Register 000          */
  __IO uint8_t  IMC127;            /*!< Interrupu Mode Control Register 000          */
  __IO uint8_t  IMC128;            /*!< Interrupu Mode Control Register 000          */
  __IO uint8_t  IMC129;            /*!< Interrupu Mode Control Register 000          */
  __IO uint8_t  IMC130;            /*!< Interrupu Mode Control Register 000          */
  __IO uint8_t  IMC131;            /*!< Interrupu Mode Control Register 000          */
  __IO uint8_t  IMC132;            /*!< Interrupu Mode Control Register 000          */
  __IO uint8_t  IMC133;            /*!< Interrupu Mode Control Register 000          */
  __IO uint8_t  IMC134;            /*!< Interrupu Mode Control Register 000          */
  __IO uint8_t  IMC135;            /*!< Interrupu Mode Control Register 000          */
  __IO uint8_t  IMC136;            /*!< Interrupu Mode Control Register 000          */
  __IO uint8_t  IMC137;            /*!< Interrupu Mode Control Register 000          */
  __IO uint8_t  IMC138;            /*!< Interrupu Mode Control Register 000          */
  __IO uint8_t  IMC139;            /*!< Interrupu Mode Control Register 000          */
  __IO uint8_t  IMC140;            /*!< Interrupu Mode Control Register 000          */
  __IO uint8_t  IMC141;            /*!< Interrupu Mode Control Register 000          */
} TSB_IB_TypeDef;

/**
  * @brief Interrupt Monitor Register
  */
typedef struct
{
  __I  uint32_t FLGNMI;            /*!< NMI Interrupt Monitor Flag 0                 */
  __I  uint32_t FLG1;              /*!< Interrupt Monitor Flag 1 (032 - 063)         */
  __I  uint32_t FLG2;              /*!< Interrupt Monitor Flag 2 (064 - 095)         */
  __I  uint32_t FLG3;              /*!< Interrupt Monitor Flag 3 (096 - 127)         */
  __I  uint32_t FLG4;              /*!< Interrupt Monitor Flag 4 (128 - 159)         */
  __I  uint32_t FLG5;              /*!< Interrupt Monitor Flag 5 (160 - 191)         */
  __I  uint32_t FLG6;              /*!< Interrupt Monitor Flag 6 (192 - 223)         */
  __I  uint32_t FLG7;              /*!< Interrupt Monitor Flag 7 (224 - 225)         */
} TSB_IMN_TypeDef;

/**
  * @brief DNF
  */
typedef struct
{
  __IO uint32_t CKCR;              /*!< DNF clock Control register                   */
  __IO uint32_t ENCR;              /*!< DNF Enable register                          */
} TSB_DNF_TypeDef;

/**
  * @brief Watchdog Timer (WD)
  */
typedef struct
{
  __IO uint32_t PRO;               /*!< SIWD Protect Register                        */
  __IO uint32_t EN;                /*!< SIWD Enable Register                         */
  __O  uint32_t CR;                /*!< SIWD Control Register                        */
  __IO uint32_t MOD;               /*!< SIWD Mode Register                           */
  __I  uint32_t MONI;              /*!< SIWD Monitor Register                        */
} TSB_SIWD_TypeDef;

/**
  * @brief NBD
  */
typedef struct
{
  __IO uint32_t CR0;               /*!< NBD control register 0                       */
  __IO uint32_t CR1;               /*!< NBD control register 1                       */
} TSB_NBD_TypeDef;

