MikroElektronika/core_packages/ARM/gcc_clang/def/toshiba/TMPM4G9FEFG/mcu.h
/**
  * @brief Malti Porpose Direct Memory Accsess(MDMA)
  */
typedef struct
{
  __I  uint32_t REV;               /*!< MDMAC Revision Register                      */
  __IO uint32_t CEN;               /*!< MDMAC Channel Enable Register                */
  __IO uint32_t REQ;               /*!< MDMAC Transfer Request Register              */
  __IO uint32_t SUS;               /*!< MDMAC Transfer Suspension Register           */
  __IO uint32_t ACT;               /*!< MDMAC Transfer Active Register               */
  __IO uint32_t END;               /*!< MDMAC Transfer End Register                  */
  __IO uint32_t PRI;               /*!< MDMAC Priority Setting Register              */
  __IO uint32_t ENE;               /*!< MDMAC End Interrupt Enable Register          */
  __IO uint32_t IAD;               /*!< MDMAC Channel Information Address Register   */
  __IO uint32_t SAD;               /*!< MDMAC Channel Save Address Register          */
  __I  uint32_t CHN;               /*!< MDMAC Channel Number Register                */
  __I  uint32_t XFTYP;             /*!< MDMAC Channel Number Register                */
  __I  uint32_t XFSAD;             /*!< MDMAC Transfer Source Address Register       */
  __I  uint32_t XFDAD;             /*!< MDMAC Transfer Destination Address Register  */
  __I  uint32_t XFSIZ;             /*!< MDMAC Transfer Size Register                 */
  __I  uint32_t DSADS;             /*!< MDMAC Descriptor Address Register            */
  __I  uint32_t DSNUM;             /*!< MDMAC Descriptor Number Register             */
  __IO uint32_t LRQ;               /*!< MDMAC Level Request Register                 */
       uint32_t RESERVED0[2];
  __I  uint32_t C00XFTYP;          /*!< MDMAC Channel 00 Number Avoidance Register   */
  __I  uint32_t C00XFSAD;          /*!< MDMAC Channel 00 Transfer Source Address Avoidance Register*/
  __I  uint32_t C00XFDAD;          /*!< MDMAC Channel 00 Transfer Destination Address Avoidance Register*/
  __I  uint32_t C00XFSIZ;          /*!< MDMAC Channel 00 Transfer Size Avoidance Register*/
  __I  uint32_t C00DSADS;          /*!< MDMAC Channel 00 Descriptor Address Avoidance Register*/
  __I  uint32_t C00DSNUM;          /*!< MDMAC Channel 00 Descriptor Number Avoidance Register*/
       uint32_t RESERVED1[2];
  __I  uint32_t C01XFTYP;          /*!< MDMAC Channel 01 Number Avoidance Register   */
  __I  uint32_t C01XFSAD;          /*!< MDMAC Channel 01 Transfer Source Address Avoidance Register*/
  __I  uint32_t C01XFDAD;          /*!< MDMAC Channel 01 Transfer Destination Address Avoidance Register*/
  __I  uint32_t C01XFSIZ;          /*!< MDMAC Channel 01 Transfer Size Avoidance Register*/
  __I  uint32_t C01DSADS;          /*!< MDMAC Channel 01 Descriptor Address Avoidance Register*/
  __I  uint32_t C01DSNUM;          /*!< MDMAC Channel 01 Descriptor Number Avoidance Register*/
       uint32_t RESERVED2[2];
  __I  uint32_t C02XFTYP;          /*!< MDMAC Channel 02 Number Avoidance Register   */
  __I  uint32_t C02XFSAD;          /*!< MDMAC Channel 02 Transfer Source Address Avoidance Register*/
  __I  uint32_t C02XFDAD;          /*!< MDMAC Channel 02 Transfer Destination Address Avoidance Register*/
  __I  uint32_t C02XFSIZ;          /*!< MDMAC Channel 02 Transfer Size Avoidance Register*/
  __I  uint32_t C02DSADS;          /*!< MDMAC Channel 02 Descriptor Address Avoidance Register*/
  __I  uint32_t C02DSNUM;          /*!< MDMAC Channel 02 Descriptor Number Avoidance Register*/
       uint32_t RESERVED3[2];
  __I  uint32_t C03XFTYP;          /*!< MDMAC Channel 03 Number Avoidance Register   */
  __I  uint32_t C03XFSAD;          /*!< MDMAC Channel 03 Transfer Source Address Avoidance Register*/
  __I  uint32_t C03XFDAD;          /*!< MDMAC Channel 03 Transfer Destination Address Avoidance Register*/
  __I  uint32_t C03XFSIZ;          /*!< MDMAC Channel 03 Transfer Size Avoidance Register*/
  __I  uint32_t C03DSADS;          /*!< MDMAC Channel 03 Descriptor Address Avoidance Register*/
  __I  uint32_t C03DSNUM;          /*!< MDMAC Channel 03 Descriptor Number Avoidance Register*/
       uint32_t RESERVED4[2];
  __I  uint32_t C04XFTYP;          /*!< MDMAC Channel 04 Number Avoidance Register   */
  __I  uint32_t C04XFSAD;          /*!< MDMAC Channel 04 Transfer Source Address Avoidance Register*/
  __I  uint32_t C04XFDAD;          /*!< MDMAC Channel 04 Transfer Destination Address Avoidance Register*/
  __I  uint32_t C04XFSIZ;          /*!< MDMAC Channel 04 Transfer Size Avoidance Register*/
  __I  uint32_t C04DSADS;          /*!< MDMAC Channel 04 Descriptor Address Avoidance Register*/
  __I  uint32_t C04DSNUM;          /*!< MDMAC Channel 04 Descriptor Number Avoidance Register*/
       uint32_t RESERVED5[2];
  __I  uint32_t C05XFTYP;          /*!< MDMAC Channel 05 Number Avoidance Register   */
  __I  uint32_t C05XFSAD;          /*!< MDMAC Channel 05 Transfer Source Address Avoidance Register*/
  __I  uint32_t C05XFDAD;          /*!< MDMAC Channel 05 Transfer Destination Address Avoidance Register*/
  __I  uint32_t C05XFSIZ;          /*!< MDMAC Channel 05 Transfer Size Avoidance Register*/
  __I  uint32_t C05DSADS;          /*!< MDMAC Channel 05 Descriptor Address Avoidance Register*/
  __I  uint32_t C05DSNUM;          /*!< MDMAC Channel 05 Descriptor Number Avoidance Register*/
       uint32_t RESERVED6[2];
  __I  uint32_t C06XFTYP;          /*!< MDMAC Channel 06 Number Avoidance Register   */
  __I  uint32_t C06XFSAD;          /*!< MDMAC Channel 06 Transfer Source Address Avoidance Register*/
  __I  uint32_t C06XFDAD;          /*!< MDMAC Channel 06 Transfer Destination Address Avoidance Register*/
  __I  uint32_t C06XFSIZ;          /*!< MDMAC Channel 06 Transfer Size Avoidance Register*/
  __I  uint32_t C06DSADS;          /*!< MDMAC Channel 06 Descriptor Address Avoidance Register*/
  __I  uint32_t C06DSNUM;          /*!< MDMAC Channel 06 Descriptor Number Avoidance Register*/
       uint32_t RESERVED7[2];
  __I  uint32_t C07XFTYP;          /*!< MDMAC Channel 07 Number Avoidance Register   */
  __I  uint32_t C07XFSAD;          /*!< MDMAC Channel 07 Transfer Source Address Avoidance Register*/
  __I  uint32_t C07XFDAD;          /*!< MDMAC Channel 07 Transfer Destination Address Avoidance Register*/
  __I  uint32_t C07XFSIZ;          /*!< MDMAC Channel 07 Transfer Size Avoidance Register*/
  __I  uint32_t C07DSADS;          /*!< MDMAC Channel 07 Descriptor Address Avoidance Register*/
  __I  uint32_t C07DSNUM;          /*!< MDMAC Channel 07 Descriptor Number Avoidance Register*/
       uint32_t RESERVED8[2];
  __I  uint32_t C08XFTYP;          /*!< MDMAC Channel 08 Number Avoidance Register   */
  __I  uint32_t C08XFSAD;          /*!< MDMAC Channel 08 Transfer Source Address Avoidance Register*/
  __I  uint32_t C08XFDAD;          /*!< MDMAC Channel 08 Transfer Destination Address Avoidance Register*/
  __I  uint32_t C08XFSIZ;          /*!< MDMAC Channel 08 Transfer Size Avoidance Register*/
  __I  uint32_t C08DSADS;          /*!< MDMAC Channel 08 Descriptor Address Avoidance Register*/
  __I  uint32_t C08DSNUM;          /*!< MDMAC Channel 08 Descriptor Number Avoidance Register*/
       uint32_t RESERVED9[2];
  __I  uint32_t C09XFTYP;          /*!< MDMAC Channel 09 Number Avoidance Register   */
  __I  uint32_t C09XFSAD;          /*!< MDMAC Channel 09 Transfer Source Address Avoidance Register*/
  __I  uint32_t C09XFDAD;          /*!< MDMAC Channel 09 Transfer Destination Address Avoidance Register*/
  __I  uint32_t C09XFSIZ;          /*!< MDMAC Channel 09 Transfer Size Avoidance Register*/
  __I  uint32_t C09DSADS;          /*!< MDMAC Channel 09 Descriptor Address Avoidance Register*/
  __I  uint32_t C09DSNUM;          /*!< MDMAC Channel 09 Descriptor Number Avoidance Register*/
       uint32_t RESERVED10[2];
  __I  uint32_t C10XFTYP;          /*!< MDMAC Channel 10 Number Avoidance Register   */
  __I  uint32_t C10XFSAD;          /*!< MDMAC Channel 10 Transfer Source Address Avoidance Register*/
  __I  uint32_t C10XFDAD;          /*!< MDMAC Channel 10 Transfer Destination Address Avoidance Register*/
  __I  uint32_t C10XFSIZ;          /*!< MDMAC Channel 10 Transfer Size Avoidance Register*/
  __I  uint32_t C10DSADS;          /*!< MDMAC Channel 10 Descriptor Address Avoidance Register*/
  __I  uint32_t C10DSNUM;          /*!< MDMAC Channel 10 Descriptor Number Avoidance Register*/
       uint32_t RESERVED11[2];
  __I  uint32_t C11XFTYP;          /*!< MDMAC Channel 11 Number Avoidance Register   */
  __I  uint32_t C11XFSAD;          /*!< MDMAC Channel 11 Transfer Source Address Avoidance Register*/
  __I  uint32_t C11XFDAD;          /*!< MDMAC Channel 11 Transfer Destination Address Avoidance Register*/
  __I  uint32_t C11XFSIZ;          /*!< MDMAC Channel 11 Transfer Size Avoidance Register*/
  __I  uint32_t C11DSADS;          /*!< MDMAC Channel 11 Descriptor Address Avoidance Register*/
  __I  uint32_t C11DSNUM;          /*!< MDMAC Channel 11 Descriptor Number Avoidance Register*/
       uint32_t RESERVED12[2];
  __I  uint32_t C12XFTYP;          /*!< MDMAC Channel 12 Number Avoidance Register   */
  __I  uint32_t C12XFSAD;          /*!< MDMAC Channel 12 Transfer Source Address Avoidance Register*/
  __I  uint32_t C12XFDAD;          /*!< MDMAC Channel 12 Transfer Destination Address Avoidance Register*/
  __I  uint32_t C12XFSIZ;          /*!< MDMAC Channel 12 Transfer Size Avoidance Register*/
  __I  uint32_t C12DSADS;          /*!< MDMAC Channel 12 Descriptor Address Avoidance Register*/
  __I  uint32_t C12DSNUM;          /*!< MDMAC Channel 12 Descriptor Number Avoidance Register*/
       uint32_t RESERVED13[2];
  __I  uint32_t C13XFTYP;          /*!< MDMAC Channel 13 Number Avoidance Register   */
  __I  uint32_t C13XFSAD;          /*!< MDMAC Channel 13 Transfer Source Address Avoidance Register*/
  __I  uint32_t C13XFDAD;          /*!< MDMAC Channel 13 Transfer Destination Address Avoidance Register*/
  __I  uint32_t C13XFSIZ;          /*!< MDMAC Channel 13 Transfer Size Avoidance Register*/
  __I  uint32_t C13DSADS;          /*!< MDMAC Channel 13 Descriptor Address Avoidance Register*/
  __I  uint32_t C13DSNUM;          /*!< MDMAC Channel 13 Descriptor Number Avoidance Register*/
       uint32_t RESERVED14[2];
  __I  uint32_t C14XFTYP;          /*!< MDMAC Channel 14 Number Avoidance Register   */
  __I  uint32_t C14XFSAD;          /*!< MDMAC Channel 14 Transfer Source Address Avoidance Register*/
  __I  uint32_t C14XFDAD;          /*!< MDMAC Channel 14 Transfer Destination Address Avoidance Register*/
  __I  uint32_t C14XFSIZ;          /*!< MDMAC Channel 14 Transfer Size Avoidance Register*/
  __I  uint32_t C14DSADS;          /*!< MDMAC Channel 14 Descriptor Address Avoidance Register*/
  __I  uint32_t C14DSNUM;          /*!< MDMAC Channel 14 Descriptor Number Avoidance Register*/
       uint32_t RESERVED15[2];
  __I  uint32_t C15XFTYP;          /*!< MDMAC Channel 15 Number Avoidance Register   */
  __I  uint32_t C15XFSAD;          /*!< MDMAC Channel 15 Transfer Source Address Avoidance Register*/
  __I  uint32_t C15XFDAD;          /*!< MDMAC Channel 15 Transfer Destination Address Avoidance Register*/
  __I  uint32_t C15XFSIZ;          /*!< MDMAC Channel 15 Transfer Size Avoidance Register*/
  __I  uint32_t C15DSADS;          /*!< MDMAC Channel 15 Descriptor Address Avoidance Register*/
  __I  uint32_t C15DSNUM;          /*!< MDMAC Channel 15 Descriptor Number Avoidance Register*/
       uint32_t RESERVED16[2];
  __I  uint32_t C16XFTYP;          /*!< MDMAC Channel 16 Number Avoidance Register   */
  __I  uint32_t C16XFSAD;          /*!< MDMAC Channel 16 Transfer Source Address Avoidance Register*/
  __I  uint32_t C16XFDAD;          /*!< MDMAC Channel 16 Transfer Destination Address Avoidance Register*/
  __I  uint32_t C16XFSIZ;          /*!< MDMAC Channel 16 Transfer Size Avoidance Register*/
  __I  uint32_t C16DSADS;          /*!< MDMAC Channel 16 Descriptor Address Avoidance Register*/
  __I  uint32_t C16DSNUM;          /*!< MDMAC Channel 16 Descriptor Number Avoidance Register*/
       uint32_t RESERVED17[2];
  __I  uint32_t C17XFTYP;          /*!< MDMAC Channel 17 Number Avoidance Register   */
  __I  uint32_t C17XFSAD;          /*!< MDMAC Channel 17 Transfer Source Address Avoidance Register*/
  __I  uint32_t C17XFDAD;          /*!< MDMAC Channel 17 Transfer Destination Address Avoidance Register*/
  __I  uint32_t C17XFSIZ;          /*!< MDMAC Channel 17 Transfer Size Avoidance Register*/
  __I  uint32_t C17DSADS;          /*!< MDMAC Channel 17 Descriptor Address Avoidance Register*/
  __I  uint32_t C17DSNUM;          /*!< MDMAC Channel 17 Descriptor Number Avoidance Register*/
       uint32_t RESERVED18[2];
  __I  uint32_t C18XFTYP;          /*!< MDMAC Channel 18 Number Avoidance Register   */
  __I  uint32_t C18XFSAD;          /*!< MDMAC Channel 18 Transfer Source Address Avoidance Register*/
  __I  uint32_t C18XFDAD;          /*!< MDMAC Channel 18 Transfer Destination Address Avoidance Register*/
  __I  uint32_t C18XFSIZ;          /*!< MDMAC Channel 18 Transfer Size Avoidance Register*/
  __I  uint32_t C18DSADS;          /*!< MDMAC Channel 18 Descriptor Address Avoidance Register*/
  __I  uint32_t C18DSNUM;          /*!< MDMAC Channel 18 Descriptor Number Avoidance Register*/
       uint32_t RESERVED19[2];
  __I  uint32_t C19XFTYP;          /*!< MDMAC Channel 19 Number Avoidance Register   */
  __I  uint32_t C19XFSAD;          /*!< MDMAC Channel 19 Transfer Source Address Avoidance Register*/
  __I  uint32_t C19XFDAD;          /*!< MDMAC Channel 19 Transfer Destination Address Avoidance Register*/
  __I  uint32_t C19XFSIZ;          /*!< MDMAC Channel 19 Transfer Size Avoidance Register*/
  __I  uint32_t C19DSADS;          /*!< MDMAC Channel 19 Descriptor Address Avoidance Register*/
  __I  uint32_t C19DSNUM;          /*!< MDMAC Channel 19 Descriptor Number Avoidance Register*/
       uint32_t RESERVED20[2];
  __I  uint32_t C20XFTYP;          /*!< MDMAC Channel 20 Number Avoidance Register   */
  __I  uint32_t C20XFSAD;          /*!< MDMAC Channel 20 Transfer Source Address Avoidance Register*/
  __I  uint32_t C20XFDAD;          /*!< MDMAC Channel 20 Transfer Destination Address Avoidance Register*/
  __I  uint32_t C20XFSIZ;          /*!< MDMAC Channel 20 Transfer Size Avoidance Register*/
  __I  uint32_t C20DSADS;          /*!< MDMAC Channel 20 Descriptor Address Avoidance Register*/
  __I  uint32_t C20DSNUM;          /*!< MDMAC Channel 20 Descriptor Number Avoidance Register*/
       uint32_t RESERVED21[2];
  __I  uint32_t C21XFTYP;          /*!< MDMAC Channel 21 Number Avoidance Register   */
  __I  uint32_t C21XFSAD;          /*!< MDMAC Channel 21 Transfer Source Address Avoidance Register*/
  __I  uint32_t C21XFDAD;          /*!< MDMAC Channel 21 Transfer Destination Address Avoidance Register*/
  __I  uint32_t C21XFSIZ;          /*!< MDMAC Channel 21 Transfer Size Avoidance Register*/
  __I  uint32_t C21DSADS;          /*!< MDMAC Channel 21 Descriptor Address Avoidance Register*/
  __I  uint32_t C21DSNUM;          /*!< MDMAC Channel 21 Descriptor Number Avoidance Register*/
       uint32_t RESERVED22[2];
  __I  uint32_t C22XFTYP;          /*!< MDMAC Channel 22 Number Avoidance Register   */
  __I  uint32_t C22XFSAD;          /*!< MDMAC Channel 22 Transfer Source Address Avoidance Register*/
  __I  uint32_t C22XFDAD;          /*!< MDMAC Channel 22 Transfer Destination Address Avoidance Register*/
  __I  uint32_t C22XFSIZ;          /*!< MDMAC Channel 22 Transfer Size Avoidance Register*/
  __I  uint32_t C22DSADS;          /*!< MDMAC Channel 22 Descriptor Address Avoidance Register*/
  __I  uint32_t C22DSNUM;          /*!< MDMAC Channel 22 Descriptor Number Avoidance Register*/
       uint32_t RESERVED23[2];
  __I  uint32_t C23XFTYP;          /*!< MDMAC Channel 23 Number Avoidance Register   */
  __I  uint32_t C23XFSAD;          /*!< MDMAC Channel 23 Transfer Source Address Avoidance Register*/
  __I  uint32_t C23XFDAD;          /*!< MDMAC Channel 23 Transfer Destination Address Avoidance Register*/
  __I  uint32_t C23XFSIZ;          /*!< MDMAC Channel 23 Transfer Size Avoidance Register*/
  __I  uint32_t C23DSADS;          /*!< MDMAC Channel 23 Descriptor Address Avoidance Register*/
  __I  uint32_t C23DSNUM;          /*!< MDMAC Channel 23 Descriptor Number Avoidance Register*/
       uint32_t RESERVED24[2];
  __I  uint32_t C24XFTYP;          /*!< MDMAC Channel 24 Number Avoidance Register   */
  __I  uint32_t C24XFSAD;          /*!< MDMAC Channel 24 Transfer Source Address Avoidance Register*/
  __I  uint32_t C24XFDAD;          /*!< MDMAC Channel 24 Transfer Destination Address Avoidance Register*/
  __I  uint32_t C24XFSIZ;          /*!< MDMAC Channel 24 Transfer Size Avoidance Register*/
  __I  uint32_t C24DSADS;          /*!< MDMAC Channel 24 Descriptor Address Avoidance Register*/
  __I  uint32_t C24DSNUM;          /*!< MDMAC Channel 24 Descriptor Number Avoidance Register*/
       uint32_t RESERVED25[2];
  __I  uint32_t C25XFTYP;          /*!< MDMAC Channel 25 Number Avoidance Register   */
  __I  uint32_t C25XFSAD;          /*!< MDMAC Channel 25 Transfer Source Address Avoidance Register*/
  __I  uint32_t C25XFDAD;          /*!< MDMAC Channel 25 Transfer Destination Address Avoidance Register*/
  __I  uint32_t C25XFSIZ;          /*!< MDMAC Channel 25 Transfer Size Avoidance Register*/
  __I  uint32_t C25DSADS;          /*!< MDMAC Channel 25 Descriptor Address Avoidance Register*/
  __I  uint32_t C25DSNUM;          /*!< MDMAC Channel 25 Descriptor Number Avoidance Register*/
       uint32_t RESERVED26[2];
  __I  uint32_t C26XFTYP;          /*!< MDMAC Channel 26 Number Avoidance Register   */
  __I  uint32_t C26XFSAD;          /*!< MDMAC Channel 26 Transfer Source Address Avoidance Register*/
  __I  uint32_t C26XFDAD;          /*!< MDMAC Channel 26 Transfer Destination Address Avoidance Register*/
  __I  uint32_t C26XFSIZ;          /*!< MDMAC Channel 26 Transfer Size Avoidance Register*/
  __I  uint32_t C26DSADS;          /*!< MDMAC Channel 26 Descriptor Address Avoidance Register*/
  __I  uint32_t C26DSNUM;          /*!< MDMAC Channel 26 Descriptor Number Avoidance Register*/
       uint32_t RESERVED27[2];
  __I  uint32_t C27XFTYP;          /*!< MDMAC Channel 27 Number Avoidance Register   */
  __I  uint32_t C27XFSAD;          /*!< MDMAC Channel 27 Transfer Source Address Avoidance Register*/
  __I  uint32_t C27XFDAD;          /*!< MDMAC Channel 27 Transfer Destination Address Avoidance Register*/
  __I  uint32_t C27XFSIZ;          /*!< MDMAC Channel 27 Transfer Size Avoidance Register*/
  __I  uint32_t C27DSADS;          /*!< MDMAC Channel 27 Descriptor Address Avoidance Register*/
  __I  uint32_t C27DSNUM;          /*!< MDMAC Channel 27 Descriptor Number Avoidance Register*/
       uint32_t RESERVED28[2];
  __I  uint32_t C28XFTYP;          /*!< MDMAC Channel 28 Number Avoidance Register   */
  __I  uint32_t C28XFSAD;          /*!< MDMAC Channel 28 Transfer Source Address Avoidance Register*/
  __I  uint32_t C28XFDAD;          /*!< MDMAC Channel 28 Transfer Destination Address Avoidance Register*/
  __I  uint32_t C28XFSIZ;          /*!< MDMAC Channel 28 Transfer Size Avoidance Register*/
  __I  uint32_t C28DSADS;          /*!< MDMAC Channel 28 Descriptor Address Avoidance Register*/
  __I  uint32_t C28DSNUM;          /*!< MDMAC Channel 28 Descriptor Number Avoidance Register*/
       uint32_t RESERVED29[2];
  __I  uint32_t C29XFTYP;          /*!< MDMAC Channel 29 Number Avoidance Register   */
  __I  uint32_t C29XFSAD;          /*!< MDMAC Channel 29 Transfer Source Address Avoidance Register*/
  __I  uint32_t C29XFDAD;          /*!< MDMAC Channel 29 Transfer Destination Address Avoidance Register*/
  __I  uint32_t C29XFSIZ;          /*!< MDMAC Channel 29 Transfer Size Avoidance Register*/
  __I  uint32_t C29DSADS;          /*!< MDMAC Channel 29 Descriptor Address Avoidance Register*/
  __I  uint32_t C29DSNUM;          /*!< MDMAC Channel 29 Descriptor Number Avoidance Register*/
       uint32_t RESERVED30[2];
  __I  uint32_t C30XFTYP;          /*!< MDMAC Channel 30 Number Avoidance Register   */
  __I  uint32_t C30XFSAD;          /*!< MDMAC Channel 30 Transfer Source Address Avoidance Register*/
  __I  uint32_t C30XFDAD;          /*!< MDMAC Channel 30 Transfer Destination Address Avoidance Register*/
  __I  uint32_t C30XFSIZ;          /*!< MDMAC Channel 30 Transfer Size Avoidance Register*/
  __I  uint32_t C30DSADS;          /*!< MDMAC Channel 30 Descriptor Address Avoidance Register*/
  __I  uint32_t C30DSNUM;          /*!< MDMAC Channel 30 Descriptor Number Avoidance Register*/
       uint32_t RESERVED31[2];
  __I  uint32_t C31XFTYP;          /*!< MDMAC Channel 31 Number Avoidance Register   */
  __I  uint32_t C31XFSAD;          /*!< MDMAC Channel 31 Transfer Source Address Avoidance Register*/
  __I  uint32_t C31XFDAD;          /*!< MDMAC Channel 31 Transfer Destination Address Avoidance Register*/
  __I  uint32_t C31XFSIZ;          /*!< MDMAC Channel 31 Transfer Size Avoidance Register*/
  __I  uint32_t C31DSADS;          /*!< MDMAC Channel 31 Descriptor Address Avoidance Register*/
  __I  uint32_t C31DSNUM;          /*!< MDMAC Channel 31 Descriptor Number Avoidance Register*/
       uint32_t RESERVED32[238];
  __IO uint32_t MSK;               /*!< MDMAC Mask Register                          */
} TSB_MDMA_TypeDef;

#if defined ( __CC_ARM   )           /* RealView Compiler */
#pragma anon_unions
#elif (defined (__ICCARM__))         /*  ICC Compiler     */
#pragma language=extended
#endif

/**
  * @brief ARM Prime Cell PL011
  */
typedef struct
{
  __IO uint32_t DR;                /*!< Data Register                                */
union {
  __I  uint32_t RSR;               /*!< Receive Status Register                      */
  __O  uint32_t ECR;               /*!< Error Clear Register                         */
  };
       uint32_t RESERVED0[4];
  __IO uint32_t FR;                /*!< Flag Register                                */
       uint32_t RESERVED1;
  __IO uint32_t ILPR;              /*!< IrDA Low-power Counter register              */
  __IO uint32_t IBDR;              /*!< Integer Baud Rate Register                   */
  __IO uint32_t FBDR;              /*!< Fractional Baud Rate Register                */
  __IO uint32_t LCR_H;             /*!< Line Control Register                        */
  __IO uint32_t CR;                /*!< Cntrol Register                              */
  __IO uint32_t IFLS;              /*!< Interrupt FIFO Level Select Register         */
  __IO uint32_t IMSC;              /*!< Interrupt Mask set/Clear Register            */
  __I  uint32_t RIS;               /*!< Raw Interrupt Status Register                */
  __I  uint32_t MIS;               /*!< Masked Interrupt Status Register             */
  __O  uint32_t ICR;               /*!< Interrupt Clear Register                     */
  __IO uint32_t DMACR;             /*!< DMA Control Register                         */
} TSB_FURT_TypeDef;

